/*********************************************************************************************
* 文件：main.c
* 作者：Lixm 2017.09.25
* 说明：温湿度传感器实验 习题   
*       获取温湿度传感器数据，打印到PC上
* 修改：zhoucj  2018.01.02  修改为串口一
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include <ioCC2530.h>
#include "clock.h"
#include "delay.h"
#include "htu21d.h"
#include "led.h"
#include "uart1.h"
#include "stdio.h"
#include "string.h"
/*********************************************************************************************
* 名称：main()
* 功能：逻辑代码
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void main(void)
{
  float temp = 0;                                               //存储温度数据变量
  float humi = 0;                                               //存储温度数据变量
  char tx_buff[64];                                             //串口发送缓冲数组
  xtal_init();                                                  //系统时钟初始化     
  htu21d_init();                                                //温湿度传感器初始化
  uart1_init(0x00,0x00);                                        //串口初始化
  led_init();
  while(1)
  {
    temp = (htu21d_get_data(TEMPERATURE)/100.0f);               //读取温度值
    humi = (htu21d_get_data(HUMIDITY)/100.0f);                  //读取湿度值
    sprintf(tx_buff,"温度:%.2f   湿度:%.2f\r\n",temp,humi);     //字符串复制
    led_off(D2);
    delay_s(1);
    if (temp>20){
      led_on(D1);
    }
    uart1_send_string(tx_buff);                                  //串口打印
    memset(tx_buff,0,64);                                       //清空串口缓存
    
delay_s(1);                                                 //延时1s
led_off(D1);
  }
}
